create_clock -name clk -period 15 [get_ports clk]
set_clock_uncertainty 0.5 [get_clocks clk]
set_clock_transition -rise -min 0.5 [get_clocks clk]
set_clock_transition -rise -max 1.0 [get_clocks clk]
set_clock_transition -fall -min 0.5 [get_clocks clk]
set_clock_transition -fall -max 1.0 [get_clocks clk]
set_max_capacitance 1.5 [all_outputs]
set_max_fanout 8 [all_inputs]
set_input_delay -clock clk -max 1.0 [all_inputs]
set_output_delay -clock clk -max 0.5 [all_outputs]

